package MyGames.MySnakeGame;

/******* "Змейка" ************
Напишем игру "Змейка".

 Правила игры:

 Игрок управляет движением змейки, которая ползает по квадратному полю: вверх, вниз, вправо и влево.
 Остановить движение змейки нельзя.
 Цель игры — съесть как можно большее количество яблок, которые появляются поочередно,
 в случайном месте игрового поля, как только змейка "проглотит" предыдущее.
 С каждым новым яблоком змейка растет на один сегмент (занимает на одну ячейку больше).
 В нашей игре на старте змейка занимает три ячейки (имеет три сегмента) и может дорасти до 28.
 По мере того, как растет змейка, скорость игры увеличивается.
 Змейка не может проходить "сквозь себя" или выходить за пределы игрового поля.
 Игра оканчивается победой, если длина змейки увеличилась до 28 сегментов.
 Игра оканчивается проигрышем, если касается сама себя или края поля.

 Реализации игры:

 Нам понадобится класс, который будет содержать логику игры. Назовем его SnakeGame.

Создадим переменные для хранения ширины и высоты игрового поля.
 Переопределим метод родительского класса public void initialize():
 он будет содержать команды, которые выполнятся один раз при запуске игры.
 Например, установка размеров игрового поля.
 */

public class SnakeGame {

}






















